# 第七章 数据清洗和准备

## 7.1处理缺失数据

In [3]:
import pandas as pd
import numpy as np

In [5]:
string_data=pd.Series(['aardvark','artichoke',np.nan,'avocado'])

In [6]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
string_data[0]=None

In [9]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [10]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### 滤除缺失数据

In [12]:
from numpy import nan as NA

In [13]:
data=pd.Series([1,NA,3.5,NA,7])

In [14]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [15]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [16]:
data.notnull()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [18]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [19]:
data=pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [20]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
cleaned=data.dropna()

In [22]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [23]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [24]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [25]:
data[4]=NA

In [26]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [30]:
data.dropna(how='all',axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [61]:
df=pd.DataFrame(np.random.randn(7,3))

In [62]:
df

          0         1         2
0 -2.085956 -0.657695  0.093876
1  0.826437  0.108654 -0.941321
2  0.938679  0.585989 -0.018994
3 -0.690932 -0.052915  0.590514
4 -0.598232 -1.316301 -0.704146
5  0.962857  1.005163 -1.475015
6  1.320148 -0.490908  0.477582

In [63]:
df.iloc[:4,1]

0   -0.657695
1    0.108654
2    0.585989
3   -0.052915
Name: 1, dtype: float64

In [64]:
df.iloc[:2,2]

0    0.093876
1   -0.941321
Name: 2, dtype: float64

In [65]:
df.iloc[:4,1]=NA

In [66]:
df.iloc[:2,2]=NA

In [67]:
df

          0         1         2
0 -2.085956       NaN       NaN
1  0.826437       NaN       NaN
2  0.938679       NaN -0.018994
3 -0.690932       NaN  0.590514
4 -0.598232 -1.316301 -0.704146
5  0.962857  1.005163 -1.475015
6  1.320148 -0.490908  0.477582

In [68]:
df.dropna()

          0         1         2
4 -0.598232 -1.316301 -0.704146
5  0.962857  1.005163 -1.475015
6  1.320148 -0.490908  0.477582

In [69]:
df.dropna(thresh=2)

          0         1         2
2  0.938679       NaN -0.018994
3 -0.690932       NaN  0.590514
4 -0.598232 -1.316301 -0.704146
5  0.962857  1.005163 -1.475015
6  1.320148 -0.490908  0.477582

### 填充缺失数据

In [70]:
df

          0         1         2
0 -2.085956       NaN       NaN
1  0.826437       NaN       NaN
2  0.938679       NaN -0.018994
3 -0.690932       NaN  0.590514
4 -0.598232 -1.316301 -0.704146
5  0.962857  1.005163 -1.475015
6  1.320148 -0.490908  0.477582

In [71]:
df.fillna(0)

          0         1         2
0 -2.085956  0.000000  0.000000
1  0.826437  0.000000  0.000000
2  0.938679  0.000000 -0.018994
3 -0.690932  0.000000  0.590514
4 -0.598232 -1.316301 -0.704146
5  0.962857  1.005163 -1.475015
6  1.320148 -0.490908  0.477582

In [72]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -2.085956  0.500000  0.000000
1  0.826437  0.500000  0.000000
2  0.938679  0.500000 -0.018994
3 -0.690932  0.500000  0.590514
4 -0.598232 -1.316301 -0.704146
5  0.962857  1.005163 -1.475015
6  1.320148 -0.490908  0.477582

In [77]:
_=df.fillna(0,inplace=True)

In [78]:
df

          0         1         2
0 -2.085956  0.000000  0.000000
1  0.826437  0.000000  0.000000
2  0.938679  0.000000 -0.018994
3 -0.690932  0.000000  0.590514
4 -0.598232 -1.316301 -0.704146
5  0.962857  1.005163 -1.475015
6  1.320148 -0.490908  0.477582

In [80]:
#对reindexing 有效的那些插值方法也可用于fillna
df=pd.DataFrame(np.random.randn(6,3))

In [81]:
df

          0         1         2
0 -0.532553 -1.359129 -2.473914
1  0.350396 -0.831264 -0.569703
2 -0.549741 -0.411842 -1.440731
3 -0.053821  0.676391  0.081807
4  0.776033 -1.255138  1.150700
5 -0.953151  1.103935  0.956523

In [82]:
df.iloc[2:,1]

2   -0.411842
3    0.676391
4   -1.255138
5    1.103935
Name: 1, dtype: float64

In [83]:
df.iloc[2:,1]=NA

In [84]:
df.iloc[4:,2]

4    1.150700
5    0.956523
Name: 2, dtype: float64

In [85]:
df.iloc[4:,2]=NA

In [86]:
df

          0         1         2
0 -0.532553 -1.359129 -2.473914
1  0.350396 -0.831264 -0.569703
2 -0.549741       NaN -1.440731
3 -0.053821       NaN  0.081807
4  0.776033       NaN       NaN
5 -0.953151       NaN       NaN

In [87]:
df.fillna(method='ffill')

          0         1         2
0 -0.532553 -1.359129 -2.473914
1  0.350396 -0.831264 -0.569703
2 -0.549741 -0.831264 -1.440731
3 -0.053821 -0.831264  0.081807
4  0.776033 -0.831264  0.081807
5 -0.953151 -0.831264  0.081807

In [89]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -0.532553 -1.359129 -2.473914
1  0.350396 -0.831264 -0.569703
2 -0.549741 -0.831264 -1.440731
3 -0.053821 -0.831264  0.081807
4  0.776033       NaN  0.081807
5 -0.953151       NaN  0.081807

In [93]:
data=pd.Series([1.,NA,3.5,NA,7])

In [94]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [91]:
data.mean()

3.8333333333333335

In [92]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 7.2数据转换

### 移除重复数据

In [95]:
data=pd.DataFrame({'k1':['one','two'] * 3 + ['two'],'k2':[1,1,2,3,3,4,4]})

In [96]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [98]:
#表示各行是否是重复行(前面出现过的行)
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [99]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [100]:
data['v1']=range(7)

In [101]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [102]:
#根据k1列过滤重复项
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [103]:
data.drop_duplicates(['k1'],keep='last')

    k1  k2  v1
4  one   3   4
6  two   4   6

In [104]:
data.drop_duplicates(['k1','k2'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

In [105]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### 利用函数或映射进行数据转换

In [135]:
data=pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','pastrami','honey ham','novalox'],'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [136]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8      novalox     6.0

In [137]:
meat_to_animal={'bacon':'pig','pulled pork':'pig','pastrami':'cow','corned beef':'cow','honey ham':'pig','novalox':'salmon'}

In [138]:
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'novalox': 'salmon'}

In [139]:
lowercased=data['food'].str.lower()

In [130]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8        novalox
Name: food, dtype: object

In [140]:
data['animal']=lowercased.map(meat_to_animal)

In [141]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8      novalox     6.0  salmon

In [142]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### 替换值

In [143]:
data=pd.Series([1.,-999.,2.,-999.,-1000.,3.])

In [144]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [145]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [146]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [147]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [148]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### 重命名轴索引

In [149]:
data=pd.DataFrame(np.arange(12).reshape((3,4)),index=['Ohio','Colorado','New York'],columns=['one','two','three','four'])

In [150]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [151]:
data.index

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

In [154]:
transform_upper = lambda x : x.upper()

In [156]:
data.index.map(transform_upper)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [158]:
transform_lower=lambda x : x .lower()

In [159]:
data.index.map(transform_lower)

Index(['ohio', 'colorado', 'new york'], dtype='object')

In [160]:
str.title

In [161]:
str.upper

In [162]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [165]:
data.rename(index=str.lower,columns=str.upper)

          ONE  TWO  THREE  FOUR
ohio        0    1      2     3
colorado    4    5      6     7
new york    8    9     10    11

In [166]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [167]:
#需要就地的修改某个数据集,传入 inplace=True 即可
data.rename(index={'Ohio':'INDIANA'},columns={'three':'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
Colorado    4    5         6     7
New York    8    9        10    11

In [168]:
data.rename(index={'Ohio':'INDIANA'},inplace=True)

In [169]:
data

          one  two  three  four
INDIANA     0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

### 离散化和面元划分

In [172]:
ages=[20,22,25,27,21,23,37,31,61,45,41,32]

In [173]:
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [174]:
bins=[18,25,35,60,100]

In [175]:
cats=pd.cut(ages,bins)

In [176]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [177]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [178]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [179]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [181]:
cats1=pd.cut(ages,bins,right=False)

In [182]:
cats1.codes

array([0, 0, 1, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [183]:
cats1.categories

IntervalIndex([[18, 25), [25, 35), [35, 60), [60, 100)]
              closed='left',
              dtype='interval[int64]')

In [184]:
group_names=['Youth','YoungAdult','MiddleAged','Senior']

In [185]:
group_names

['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [186]:
pd.cut(ages,bins,labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [187]:
data=np.random.rand(20)

In [188]:
data

array([0.59613997, 0.88350472, 0.1806559 , 0.24587218, 0.01675582,
       0.44713671, 0.42219412, 0.15594695, 0.40913834, 0.52717446,
       0.87552814, 0.31088567, 0.71742192, 0.12510457, 0.78941334,
       0.3527112 , 0.63384977, 0.03846994, 0.34969853, 0.56586278])

In [191]:
pd.cut(data,4,precision=2)

[(0.45, 0.67], (0.67, 0.88], (0.016, 0.23], (0.23, 0.45], (0.016, 0.23], ..., (0.23, 0.45], (0.45, 0.67], (0.016, 0.23], (0.23, 0.45], (0.45, 0.67]]
Length: 20
Categories (4, interval[float64]): [(0.016, 0.23] < (0.23, 0.45] < (0.45, 0.67] < (0.67, 0.88]]

In [192]:
data=np.random.rand(1000)

In [195]:
cats=pd.qcut(data,4)

In [196]:
cats

[(0.513, 0.767], (0.246, 0.513], (0.513, 0.767], (0.246, 0.513], (0.513, 0.767], ..., (0.767, 0.999], (0.513, 0.767], (0.513, 0.767], (0.246, 0.513], (0.767, 0.999]]
Length: 1000
Categories (4, interval[float64]): [(-0.00031500000000000007, 0.246] < (0.246, 0.513] < (0.513, 0.767] < (0.767, 0.999]]

In [197]:
pd.value_counts(cats)

(0.767, 0.999]                      250
(0.513, 0.767]                      250
(0.246, 0.513]                      250
(-0.00031500000000000007, 0.246]    250
dtype: int64

In [199]:
cats=pd.qcut(data,[0,0.1,0.5,0.9,1.])

In [200]:
pd.value_counts(cats)

(0.513, 0.908]                       400
(0.0966, 0.513]                      400
(0.908, 0.999]                       100
(-0.00031500000000000007, 0.0966]    100
dtype: int64

### 检测和过滤异常值

In [201]:
data=pd.DataFrame(np.random.randn(1000,4))

In [203]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.013616    -0.010167    -0.042981     0.024811
std       1.004773     0.987142     0.982613     1.022190
min      -3.116854    -3.630875    -3.324018    -3.136243
25%      -0.640670    -0.677944    -0.713104    -0.680873
50%      -0.016148    -0.011363    -0.025110     0.041848
75%       0.681466     0.690810     0.605046     0.764053
max       3.280722     3.971545     3.252677     2.927507

In [207]:
col=data[2]

In [208]:
col[np.abs(col)>3]

543   -3.313845
830   -3.324018
856    3.252677
945   -3.322147
Name: 2, dtype: float64

In [209]:
#选出全部含有 超过3 或 -3 的值的行
data[(np.abs(data)>3).any(1)]

            0         1         2         3
149  0.562342  3.971545  0.092015  0.948530
228 -3.116854 -0.222531  1.969380  0.891105
354  0.353210 -3.009290  1.989174 -0.126073
543  1.982731  1.259017 -3.313845 -0.966822
618 -0.711925 -3.630875  0.570458  0.341303
745 -0.264169 -1.565688  1.468636 -3.136243
830 -0.046137 -0.833070 -3.324018  0.756376
839  1.976652  3.456831  1.294911 -0.067511
846  3.034645  0.593156 -0.245207 -0.404563
856 -0.213596  0.830970  3.252677 -1.423751
931  1.385685  0.682369 -2.872713 -3.129617
934  3.280722  0.809673 -0.231366 -0.730914
945  0.186699  0.442495 -3.322147 -0.458379

In [217]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0  1.0
1 -1.0 -1.0 -1.0  1.0
2  1.0  1.0 -1.0 -1.0
3  1.0  1.0 -1.0 -1.0
4  1.0  1.0  1.0  1.0

In [218]:
(np.sign(data) * 3) .head()

     0    1    2    3
0  3.0  3.0  3.0  3.0
1 -3.0 -3.0 -3.0  3.0
2  3.0  3.0 -3.0 -3.0
3  3.0  3.0 -3.0 -3.0
4  3.0  3.0  3.0  3.0

In [216]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.013418    -0.010956    -0.042274     0.025077
std       1.003436     0.980028     0.978741     1.021385
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.640670    -0.677944    -0.713104    -0.680873
50%      -0.016148    -0.011363    -0.025110     0.041848
75%       0.681466     0.690810     0.605046     0.764053
max       3.000000     3.000000     3.000000     2.927507

### 排列和随机采样

In [219]:
df=pd.DataFrame(np.arange(5*4).reshape((5,4)))

In [220]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [221]:
sampler=np.random.permutation(5)

In [222]:
sampler

array([1, 2, 4, 0, 3])

In [223]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
2   8   9  10  11
4  16  17  18  19
0   0   1   2   3
3  12  13  14  15

In [224]:
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
2   8   9  10  11
0   0   1   2   3

In [225]:
choices=pd.Series([5,7,-1,6,4])

In [229]:
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [227]:
draws=choices.sample(n=10,replace=True)

In [228]:
draws

3    6
1    7
0    5
1    7
3    6
1    7
0    5
4    4
0    5
0    5
dtype: int64

### 计算指标/哑变量

In [230]:
df=pd.DataFrame({'key':['b','b','a','c','a','b'],'data1':range(6)})

In [233]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [234]:
df['key']

0    b
1    b
2    a
3    c
4    a
5    b
Name: key, dtype: object

In [232]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [235]:
dummies=pd.get_dummies(df['key'],prefix='key')

In [236]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [237]:
df_with_dummy=df[['data1']].join(dummies)

In [245]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

#### MovieLens 1M数据集

In [293]:
mnames=['movie_id','title','genres']

In [294]:
movies=pd.read_table('datasets/movielens/movies.dat',sep='::',header=None,names=mnames)

C:\Users\James\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

In [295]:
movies.head()

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [296]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [297]:
movies.genres

0          Animation|Children's|Comedy
1         Adventure|Children's|Fantasy
2                       Comedy|Romance
3                         Comedy|Drama
4                               Comedy
5                Action|Crime|Thriller
6                       Comedy|Romance
7                 Adventure|Children's
8                               Action
9            Action|Adventure|Thriller
10                Comedy|Drama|Romance
11                       Comedy|Horror
12                Animation|Children's
13                               Drama
14            Action|Adventure|Romance
15                      Drama|Thriller
16                       Drama|Romance
17                            Thriller
18                              Comedy
19                              Action
20                 Action|Comedy|Drama
21                Crime|Drama|Thriller
22                            Thriller
23                        Drama|Sci-Fi
24                       Drama|Romance
25                               Drama
26                               Drama
27                             Romance
28                    Adventure|Sci-Fi
29                               Drama
                     ...
3853                     Horror|Sci-Fi
3854                            Comedy
3855                            Comedy
3856                  Adventure|Sci-Fi
3857                  Adventure|Sci-Fi
3858                     Comedy|Horror
3859                            Comedy
3860                            Horror
3861                     Horror|Sci-Fi
3862                     Horror|Sci-Fi
3863                     Horror|Sci-Fi
3864                            Sci-Fi
3865                            Horror
3866                    Drama|Thriller
3867                   Sci-Fi|Thriller
3868                            Horror
3869                            Horror
3870                            Horror
3871                            Horror
3872                            Horror
3873                            Comedy
3874                      Comedy|Drama
3875    Adventure|Animation|Children's
3876             Action|Drama|Thriller
3877                          Thriller
3878                            Comedy
3879                             Drama
3880                             Drama
3881                             Drama
3882                    Drama|Thriller
Name: genres, Length: 3883, dtype: object

In [298]:
all_genres=[]

In [299]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [300]:
len(all_genres)

6408

In [301]:
genres=pd.unique(all_genres)

In [302]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [303]:
len(genres)

18

In [304]:
len(movies)

3883

In [305]:
zero_matrix=np.zeros((len(movies),len(genres)))

In [306]:
zero_matrix

array([[0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       ...,
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.]])

In [307]:
zero_matrix.shape

(3883, 18)

In [308]:
dummies=pd.DataFrame(zero_matrix,columns=genres)

In [309]:
dummies.head()

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [310]:
dummies.columns

Index(['Animation', 'Children's', 'Comedy', 'Adventure', 'Fantasy', 'Romance',
       'Drama', 'Action', 'Crime', 'Thriller', 'Horror', 'Sci-Fi',
       'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir', 'Western'],
      dtype='object')

In [311]:
gen=movies.genres[0]

In [312]:
gen

"Animation|Children's|Comedy"

In [313]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [314]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [287]:
enumerate(movies.genres)

In [315]:
for i,gen in enumerate(movies.genres):
    indices=dummies.columns.get_indexer(gen.split('|'))
    #print(indices)

In [317]:
dummies.iloc[i,indices]

Drama       0.0
Thriller    0.0
Name: 3882, dtype: float64

In [318]:
dummies.iloc[i,indices]=1

In [319]:
movies_windic=movies.join(dummies.add_prefix('Genre_'))

In [320]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                0
Genre_Children's                               0
Genre_Comedy                                   0
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [239]:
np.random.seed(12345)

In [240]:
values=np.random.rand(10)

In [241]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [242]:
bins=[0,0.2,0.4,0.6,0.8,1]

In [243]:
bins

[0, 0.2, 0.4, 0.6, 0.8, 1]

In [244]:
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## 7.3字符串操作

### 字符串对象方法

In [321]:
val='a,b, guido'

In [322]:
val.split(',')

['a', 'b', ' guido']

In [323]:
pieces=[x.strip() for x in val.split(',')]

In [326]:
pieces

['a', 'b', 'guido']

In [327]:
first,second,third=pieces

In [328]:
first + '::' + second + '::' + third

'a::b::guido'

In [329]:
'::'.join(pieces)

'a::b::guido'

In [330]:
'guido' in pieces

True

In [331]:
val.index(',')

1

In [334]:
val.find('!')

-1

In [335]:
val.index('!')

ValueError: substring not found

In [336]:
val.count(',')

2

In [337]:
val

'a,b, guido'

In [338]:
val.replace(',','::')

'a::b:: guido'

In [339]:
val.replace(',','')

'ab guido'

### 正则表达式

In [340]:
import re

In [341]:
text="foo bar\t baz \tqux"

In [342]:
text

'foo bar\t baz \tqux'

In [343]:
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [344]:
regex=re.compile('\s+')

In [345]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [346]:
regex.findall(text)

[' ', '\t ', ' \t']

In [347]:
text="""Dave dave@google.com
Steve steve@google.com
Rob rob@google.com
Ryan ryan@yahoo.com
"""

In [348]:
pattern=r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [349]:
regex=re.compile(pattern,flags=re.IGNORECASE)

In [350]:
regex.findall(text)

['dave@google.com', 'steve@google.com', 'rob@google.com', 'ryan@yahoo.com']

In [352]:
m=regex.search(text)

In [353]:
m

In [354]:
text[m.start():m.end()]

'dave@google.com'

In [355]:
print(regex.match(text))

None

In [356]:
print(regex.sub('REDACTED',text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [378]:
pattern=r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [379]:
regex=re.compile(pattern,flags=re.IGNORECASE)

In [380]:
m=regex.match('wesm@bright.net')

In [381]:
m.groups()

('wesm', 'bright', 'net')

In [382]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'google', 'com'),
 ('rob', 'google', 'com'),
 ('ryan', 'yahoo', 'com')]

In [383]:
print(regex.sub(r'Username: \1,Domain: \2, Suffix: \3',text))

Dave Username: dave,Domain: google, Suffix: com
Steve Username: steve,Domain: google, Suffix: com
Rob Username: rob,Domain: google, Suffix: com
Ryan Username: ryan,Domain: yahoo, Suffix: com

### python的矢量化字符串函数

In [388]:
data={'Dave':'dave@google.com','Steve':'steve@google.com','Rob':'rob@google.com','Wes':np.nan}

In [389]:
data=pd.Series(data)

In [390]:
data

Dave      dave@google.com
Steve    steve@google.com
Rob        rob@google.com
Wes                   NaN
dtype: object

In [391]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [394]:
data.str.contains('gmail')

Dave     False
Steve    False
Rob      False
Wes        NaN
dtype: object

In [396]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [397]:
data.str.findall(pattern,flags=re.IGNORECASE)

Dave      [(dave, google, com)]
Steve    [(steve, google, com)]
Rob        [(rob, google, com)]
Wes                         NaN
dtype: object

In [398]:
matches=data.str.match(pattern,flags=re.IGNORECASE)

In [399]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [400]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [401]:
matches.str[0]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [402]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

# 第八章 数据规整: 聚合、合并 和重塑

## 8.1层次化所有

In [406]:
data=pd.Series(np.random.randn(9),index=[['a','a','a','b','b','c','c','d','d'],[1,2,3,1,3,1,2,2,3]])

In [407]:
data

a  1   -0.438570
   2   -0.539741
   3    0.476985
b  1    3.248944
   3   -1.021228
c  1   -0.577087
   2    0.124121
d  2    0.302614
   3    0.523772
dtype: float64

In [408]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [409]:
data['b']

1    3.248944
3   -1.021228
dtype: float64

In [410]:
data['b':'c']

b  1    3.248944
   3   -1.021228
c  1   -0.577087
   2    0.124121
dtype: float64

In [411]:
data.loc[['b','d']]

b  1    3.248944
   3   -1.021228
d  2    0.302614
   3    0.523772
dtype: float64

In [412]:
data.loc[:,2]

a   -0.539741
c    0.124121
d    0.302614
dtype: float64

In [415]:
#可以通过unstack方法将这段数据重新安排到一个DataFrame中
data.unstack()

          1         2         3
a -0.438570 -0.539741  0.476985
b  3.248944       NaN -1.021228
c -0.577087  0.124121       NaN
d       NaN  0.302614  0.523772

In [417]:
#unstack的逆运算是 stack
data.unstack().stack()

a  1   -0.438570
   2   -0.539741
   3    0.476985
b  1    3.248944
   3   -1.021228
c  1   -0.577087
   2    0.124121
d  2    0.302614
   3    0.523772
dtype: float64

In [418]:
frame=pd.DataFrame(np.arange(12).reshape((4,3)),index=[['a','a','b','b'],[1,2,1,2]],columns=[['Ohio','Ohio','Colorado'],['Green','Red','Green']])

In [419]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [420]:
frame.index.names=['key1','key2']

In [421]:
frame.columns.names=['state','color']

In [422]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [423]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [424]:
frame['Colorado']

color      Green
key1 key2
a    1         2
     2         5
b    1         8
     2        11

### 重排与分级排序

In [425]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [426]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [427]:
frame.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### 根据级别汇总统计

In [428]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [429]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### 使用DataFrame 的列进行索引

In [432]:
frame=pd.DataFrame({'a':range(7),'b':range(7,0,-1),'c':['one','one','one','one','two','two','two'],'d':[0,1,2,0,1,2,3]})

In [433]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  one  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [434]:
frame2=frame.set_index(['c','d'])

In [435]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
    0  3  4
two 1  4  3
    2  5  2
    3  6  1

In [437]:
frame.set_index(['c','d'],drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
    0  3  4  one  0
two 1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [438]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  one  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## 8.2 合并数据集

### 数据库风格的DataFrame合并

In [439]:
df1=pd.DataFrame({'key':['b','b','a','c','a','a','b'],'data1':range(7)})

In [440]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [441]:
df2=pd.DataFrame({'key':['a','b','d'],'data2':range(3)})

In [442]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [443]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [444]:
pd.merge(df1,df2,on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [445]:
df3=pd.DataFrame({'lkey':['b','b','a','c','a','a','b'],'data1':range(7)})

In [446]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [447]:
df4=pd.DataFrame({'rkey':['a','b','d'],'data2':range(3)})

In [448]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [449]:
pd.merge(df3,df4,left_on='lkey',right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [450]:
pd.merge(df1,df2,how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [451]:
df1=pd.DataFrame({'key':['b','b','a','c','a','b'],'data1':range(6)})

In [452]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [459]:
df2=pd.DataFrame({'key':['a','b','a','b','d'],'data2':range(5)})

In [461]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [462]:
pd.merge(df1,df2,on='key',how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [463]:
pd.merge(df1,df2,how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

In [464]:
left=pd.DataFrame({'key1':['foo','foo','bar'],'key2':['one','two','one'],'1val':[1,2,3]})

In [465]:
right=pd.DataFrame({'key1':['foo','foo','bar','bar'],'key2':['one','one','one','two'],'rval':[4,5,6,7]})

In [466]:
left

  key1 key2  1val
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [467]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [468]:
pd.merge(left,right,on=['key1','key2'],how='outer')

  key1 key2  1val  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [469]:
pd.merge(left,right,on='key1')

  key1 key2_x  1val key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [470]:
pd.merge(left,right,on='key1',suffixes=('_left','_right'))

  key1 key2_left  1val key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

### 索引上的合并

### 轴向连接

### 合并重叠数据

## 8.3重塑和轴向旋转

### 重塑层次化索引

### 将长格式旋转为宽格式

### 将宽格式旋转为长格式